<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

class StrategyDetailsTableSeeder extends Seeder
{

    /**
     * Auto generated seed file
     *
     * @return void
     */
    public function run()
    {
        

        \DB::table('strategy_details')->delete();
        
        \DB::table('strategy_details')->insert(array (
            0 => 
            array (
                '策略编号' => '00001',
                '序号' => '0001',
                '元素' => 'Y0002',
                '元素名称' => '刃长',
                '起' => '1',
                '讫' => '10',
                '条件' => 'Y0002>=1 and Y0002<=10',
                '数值' => '20',
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            1 => 
            array (
                '策略编号' => '00001',
                '序号' => '0002',
                '元素' => 'Y0002',
                '元素名称' => '刃长',
                '起' => '11',
                '讫' => '20',
                '条件' => 'Y0002>=11 and Y0002<=20',
                '数值' => '30',
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            2 => 
            array (
                '策略编号' => '00001',
                '序号' => '0003',
                '元素' => 'Y0003',
                '元素名称' => '刃长',
                '起' => '21',
                '讫' => '99999',
                '条件' => 'Y0002>=21 and Y0002<=999',
                '数值' => 'Y0002*20',
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            3 => 
            array (
                '策略编号' => '00002',
                '序号' => '0001',
                '元素' => 'Y0006',
                '元素名称' => '规格',
                '起' => '1',
                '讫' => '6',
                '条件' => 'Y0006>=1 and Y0006<=6',
                '数值' => '200',
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            4 => 
            array (
                '策略编号' => '00002',
                '序号' => '0002',
                '元素' => 'Y0006',
                '元素名称' => '规格',
                '起' => '7',
                '讫' => '12',
                '条件' => 'Y0006>=7 and Y0006<=12',
                '数值' => '300',
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            5 => 
            array (
                '策略编号' => '00002',
                '序号' => '0003',
                '元素' => 'Y0006',
                '元素名称' => '规格',
                '起' => '13',
                '讫' => '20',
                '条件' => 'Y0006>=13 and Y0006<=20',
                '数值' => '540',
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            6 => 
            array (
                '策略编号' => '00002',
                '序号' => '0004',
                '元素' => 'Y0006',
                '元素名称' => '规格',
                '起' => '21',
                '讫' => '999',
                '条件' => 'Y0006>=21 and Y0006<=999',
                '数值' => '720',
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            7 => 
            array (
                '策略编号' => '00003',
                '序号' => '0001',
                '元素' => 'Y0006',
                '元素名称' => '规格',
                '起' => '1',
                '讫' => '4',
                '条件' => 'Y0006>=1 and Y0006<=4',
                '数值' => '2*6+2',
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            8 => 
            array (
                '策略编号' => '00003',
                '序号' => '0002',
                '元素' => 'Y0006',
                '元素名称' => '规格',
                '起' => '5',
                '讫' => '6',
                '条件' => 'Y0006>=5 and Y0006<=6',
                '数值' => '2*7+3',
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            9 => 
            array (
                '策略编号' => '00003',
                '序号' => '0003',
                '元素' => 'Y0006',
                '元素名称' => '规格',
                '起' => '7',
                '讫' => '8',
                '条件' => 'Y0006>=7 and Y0006<=8',
                '数值' => '2*12+4',
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            10 => 
            array (
                '策略编号' => '00003',
                '序号' => '0004',
                '元素' => 'Y0006',
                '元素名称' => '规格',
                '起' => '9',
                '讫' => '10',
                '条件' => 'Y0006>=9 and Y0006<=10',
                '数值' => '2*16+5',
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            11 => 
            array (
                '策略编号' => '00003',
                '序号' => '0005',
                '元素' => 'Y0006',
                '元素名称' => '规格',
                '起' => '11',
                '讫' => '12',
                '条件' => 'Y0006>=11 and Y0006<=12',
                '数值' => '2*20+6',
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            12 => 
            array (
                '策略编号' => '00003',
                '序号' => '0006',
                '元素' => 'Y0006',
                '元素名称' => '规格',
                '起' => '13',
                '讫' => '14',
                '条件' => 'Y0006>=13 and Y0006<=14',
                '数值' => '3*25+15',
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            13 => 
            array (
                '策略编号' => '00003',
                '序号' => '0007',
                '元素' => 'Y0006',
                '元素名称' => '规格',
                '起' => '15',
                '讫' => '16',
                '条件' => 'Y0006>=15 and Y0006<=16',
                '数值' => '3*25+16',
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            14 => 
            array (
                '策略编号' => '00003',
                '序号' => '0008',
                '元素' => 'Y0006',
                '元素名称' => '规格',
                '起' => '17',
                '讫' => '18',
                '条件' => 'Y0006>=17 and Y0006<=18',
                '数值' => '3*30+18',
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            15 => 
            array (
                '策略编号' => '00003',
                '序号' => '0009',
                '元素' => 'Y0006',
                '元素名称' => '规格',
                '起' => '19',
                '讫' => '20',
                '条件' => 'Y0006>=19 and Y0006<=20',
                '数值' => '3*35+20',
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            16 => 
            array (
                '策略编号' => '00003',
                '序号' => '0010',
                '元素' => 'Y0006',
                '元素名称' => '规格',
                '起' => '21',
                '讫' => '25',
                '条件' => 'Y0006>=21 and Y0006<=25',
                '数值' => '3*50+25',
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            17 => 
            array (
                '策略编号' => '00003',
                '序号' => '0011',
                '元素' => 'Y0006',
                '元素名称' => '规格',
                '起' => '26',
                '讫' => '999',
                '条件' => 'Y0006>=26 and Y0006<=999',
                '数值' => '3*60+30',
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            18 => 
            array (
                '策略编号' => '00004',
                '序号' => '0001',
                '元素' => NULL,
                '元素名称' => NULL,
                '起' => NULL,
                '讫' => NULL,
                '条件' => 'Y0007==60 and Y0006>=1 and Y0006<=4',
                '数值' => '26/310*Y0005',
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            19 => 
            array (
                '策略编号' => '00004',
                '序号' => '0002',
                '元素' => NULL,
                '元素名称' => NULL,
                '起' => NULL,
                '讫' => NULL,
                '条件' => 'Y0007==60 and Y0006>=5 and Y0006<=6',
                '数值' => '56/310*Y0005',
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            20 => 
            array (
                '策略编号' => '00004',
                '序号' => '0003',
                '元素' => '',
                '元素名称' => '',
                '起' => '',
                '讫' => '',
                '条件' => 'Y0007==60 and Y0006>=7 and Y0006<=8',
                '数值' => '97/310*Y0005',
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            21 => 
            array (
                '策略编号' => '00004',
                '序号' => '0004',
                '元素' => '',
                '元素名称' => '',
                '起' => '',
                '讫' => '',
                '条件' => 'Y0007==60 and Y0006>=9 and Y0006<=10',
                '数值' => '152/310*Y0005',
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            22 => 
            array (
                '策略编号' => '00004',
                '序号' => '0005',
                '元素' => '',
                '元素名称' => '',
                '起' => '',
                '讫' => '',
                '条件' => 'Y0007==60 and Y0006>=11 and Y0006<=12',
                '数值' => '216/310*Y0005',
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            23 => 
            array (
                '策略编号' => '00004',
                '序号' => '0006',
                '元素' => '',
                '元素名称' => '',
                '起' => '',
                '讫' => '',
                '条件' => 'Y0007==60 and Y0006>=13 and Y0006<=14',
                '数值' => '295/310*Y0005',
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            24 => 
            array (
                '策略编号' => '00004',
                '序号' => '0007',
                '元素' => '',
                '元素名称' => '',
                '起' => '',
                '讫' => '',
                '条件' => 'Y0007==60 and Y0006>=15 and Y0006<=16',
                '数值' => '395/310*Y0005',
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            25 => 
            array (
                '策略编号' => '00004',
                '序号' => '0008',
                '元素' => '',
                '元素名称' => '',
                '起' => '',
                '讫' => '',
                '条件' => 'Y0007==60 and Y0006>=17 and Y0006<=18',
                '数值' => '495/310*Y0005',
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            26 => 
            array (
                '策略编号' => '00004',
                '序号' => '0009',
                '元素' => '',
                '元素名称' => '',
                '起' => '',
                '讫' => '',
                '条件' => 'Y0007==60 and Y0006>=19 and Y0006<=20',
                '数值' => '606/310*Y0005',
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            27 => 
            array (
                '策略编号' => '00004',
                '序号' => '0010',
                '元素' => '',
                '元素名称' => '',
                '起' => '',
                '讫' => '',
                '条件' => 'Y0007==60 and Y0006>=21 and Y0006<=25',
                '数值' => '933/310*Y0005',
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
            28 => 
            array (
                '策略编号' => '00004',
                '序号' => '0011',
                '元素' => '',
                '元素名称' => '',
                '起' => '',
                '讫' => '',
                '条件' => 'Y0007==60 and Y0006>=26 and Y0006<=999',
                '数值' => '1347/310*Y0005',
                'created_at' => NULL,
                'updated_at' => NULL,
            ),
        ));
        
        
    }
}